&НаКлиенте
Перем ЕстьОткрытиеКарты;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Стр = "";
	Соо = Объект.Ссылка.ХранилищеСоо.Получить();
	Если Соо<>Неопределено Тогда
		Для каждого Эл из Соо Цикл
			Стр = Стр+""+Эл.Ключ+" - "+Эл.Значение+Символы.ПС;
			Если ТипЗнч(Эл.Значение)=Тип("ТаблицаЗначений") Тогда
				Для каждого с из Эл.Значение Цикл
					Стр = Стр+"      - "+С.Наименование+Символы.ПС;
				КонецЦикла;
			ИНачеЕсли ТипЗнч(Эл.Значение) = Тип("Структура") Тогда
				Стр = Стр+"    "+Справочники[Эл.Значение.Вид].Получитьссылку(Эл.Значение.Ид)+Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	КонецЕСлИ;
	стрСооИзХранилища = Стр;
	
	Если Объект.Широта=0 или Объект.Долгота = 0 ТОгда
		Элементы.стКарта.Видимость = Ложь;
	КонецЕСЛИ;
	
	Если СокрлП(оБЪЕКТ.ИдентификаторУстройства)="" Тогда
		Элементы.стMsg.Видимость = Ложь;
	КонецЕСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДатаСинхронизации = Дата(1,1,1);
	Объект.ВерсияСинхронизации = Новый УникальныйИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура Группа2ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.стКарта ТОгда
		Если ЕстьОткрытиеКарты<>Истина Тогда
			ИнициализироватьКарту();
			ЕстьОткрытиеКарты = Истина;
		КонецЕСЛИ;
	КонецеСЛИ;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстМакета(ИмяМакета)
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	Результат = Макет.ПолучитьТекст();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьКарту()
	
	ТекстМакета = ПолучитьТекстМакета("МакетЯндекс");
	
	ТекстЗамены = "";
	//Если ЗначениеЗаполнено(ЭтотОбъект.КлючЯндексКарты) Тогда
	//	ТекстЗамены = "apikey=" + ЭтотОбъект.КлючЯндексКарты + "&";
	//КонецЕсли;
	//ТекстМакета = СтрЗаменить(ТекстМакета, "#APIKEY#", ТекстЗамены);
	ТекстМакета =   СтрЗаменить(ТекстМакета, "&широта",  ""+Формат(Объект.Широта,"ЧРД=.; ЧГ=0"));
	ТекстМакета =   СтрЗаменить(ТекстМакета, "&долгота", ""+Формат(Объект.долгота,"ЧРД=.; ЧГ=0"));
	
	#Если ВебКлиент Тогда
		Эксплорер = ТекстМакета;
	#Иначе
		Эксплорер = ТекстМакета;
	#КонецЕсли
	
	//ПоказатьНаКарте(55.8940, 37.9939);
	
КонецПроцедуры

&НаСервереБезКОнтекста
Процедура  ОтправитьMSGНаСервере(Стк)
	Ответ = глВыгрузкаДанных.ОтправитьMSG_GOOGLE(Стк);
	
	Если Ответ.КодСостояния<>200 Тогда
		Сообщить(Ответ.ПолучитьТелоКакСтроку());
	ИНаче
		чтение = Новый ЧтениеJSON;
		чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		ПОка чтение.Прочитать() Цикл
			Если Чтение.ТипТекущегоЗначения=ТипЗначенияJSON.ИмяСвойства Тогда
				Если чтение.ТекущееЗначение = "failure" ТОгда
					Чтение.Прочитать();
					Если чтение.ТекущееЗначение<>0 Тогда
						Сообщить("Ошибка отправки сообшения!");
					КонецЕсли;
				ИНачеЕсли чтение.ТекущееЗначение = "success" ТОгда
					Чтение.Прочитать();
					Если чтение.ТекущееЗначение=1 Тогда
						Сообщить("Сообщение отправлено!");
					КонецЕсли;
				КонецЕСЛИ;
			КонецЕСЛИ;
		Конеццикла;
	КонецЕСли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьMSG(Команда)

	
	Стк = Новый Структура();
	Стк.Вставить("Заголовок",СокрЛП(мсгТема));
	Стк.Вставить("Тема",СокрЛП(мсгТема));
	Стк.Вставить("Текст",СокрЛП(мсгТекст));
	
	Мас = Новый Массив;
	Мас.Добавить(СокрлП(Объект.ИдентификаторУстройства));
	Стк.Вставить("Получатели",Мас);
	
	ОтправитьMSGНаСервере(Стк);

КонецПроцедуры


