
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Зап = РегистрыСведений.ЗапросыРаспознавания.СоздатьМенеджерЗаписи();
	Зап.идЗапроса = Запись.идЗапроса;
	Зап.Прочитать();
	Если Зап.Выбран() ТОгда
		Стк = Зап.Результат.Получить();
		Если ТипЗнч(Стк) = Тип("Строка") Тогда
			Результат = Стк;
		ИНАчеЕСли ТипЗнч(Стк) = Тип("Структура") Тогда
			Для каждого Эл из Стк Цикл
				Результат=Результат+""+Эл.Ключ+" - "+Эл.Значение+символы.ПС;
			КонецЦикла;
		КонецЕСли;
	КонецеСЛИ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресКартинки(идЗапроса)
	Зап = РегистрыСведений.ЗапросыРаспознавания.СоздатьМенеджерЗаписи();
	Зап.идЗапроса = идЗапроса;
	Зап.Прочитать();
	Если Зап.Выбран()=Ложь ТОгда Возврат Неопределено; КонецеСЛИ;
	
	дд = Зап.БинКартинки.Получить();
	Если ТипЗнч(дд)<>Тип("ДвоичныеДанные") ТОгда 
		Сообщить("Ошибка типа данных "+ТипЗнч(дд));
		Возврат Неопределено;
	КонецЕСЛИ;
	
	имяФайла = ПолучитьИмяВременногоФайла("jpg");
	дд.Записать(имяФайла);
	Возврат имяФайла;
	
КонецФункции

&НаКлиенте
Процедура ПОсмотретьКартинку(Команда)
	имяФайла = ПолучитьАдресКартинки(Запись.идЗапроса);
	Если ИмяФайла<>Неопределено Тогда
		оо = Новый ОписаниеОповещения("ВыполнитьПослеЗапускаП",ЭтаФорма);
		НачатьЗапускПриложения(оо,имяФайла);
	КонецЕСлИ;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗапускаП(КодВозврата,ДополнительныеПараметры) Экспорт
	Сообщить("Готово!");
КонецПроцедуры
