
&НаКлиенте
Процедура Открытые(Команда)
	
	Если Команда.Имя = "Отмененные" Тогда
		п = "ПричинаОтказа";
		вс = 1;
	ИНАчеЕсли Команда.Имя = "Закрытые" Тогда
		п = "ДатаЗакрытияЗапроса";
		вс = 1;
	ИНАче
		п = "ДатаЗакрытияЗапроса";
		вс = 0;
	КонецЕСЛИ;
	
	
	ОтборСпискаНаСервере(п,вс);
	
	Для каждого Эл из Элементы.Группа1.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Эл) <> Тип("КнопкаФормы") ТОгда Продолжить; КонецеСЛИ;
		Если Эл.имя = Команда.имя Тогда
			Эл.ЦветФона = WebЦвета.НавахоБелый;
		ИНАче
			Эл.ЦветФона = Новый Цвет;
		КонецЕСЛИ;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтборСпискаНаСервере(РекПоле,ВС)
	Поле = Новый ПолеКомпоновкиДанных(РекПоле);
	ТипГРп =  Тип("ГруппаЭлементовОтбораКомпоновкиДанных");
	Для каждого Эл из список.Отбор.Элементы Цикл
		Если ТипЗнч(Эл) = ТипГРп ТОгда Продолжить; КонецеСЛИ;
		Эл.Использование = Ложь;
		Если Эл.ЛевоеЗначение = поле ТОгда
			Эл.Использование = Истина;
			Если ВС = 1 ТОгда
				Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно;
			ИНАче
				Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
			КонецЕслИ;
		КонецесЛИ;
		
	КонецЦИкла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Открытые(Элементы.Открытые);
КонецПроцедуры


