&НаСервере
Функция ПолучитьСоединениеАЗУР() Экспорт
	
	Стк = Новый Структура();
	Стк.Вставить("Сервер","azure1c.westeurope.cloudapp.azure.com");
	Стк.Вставить("Порт",80);
	Стк.Вставить("Логин","1с_Максим");
	Стк.Вставить("Пароль","092222");
	
	Возврат Стк;
	
КонецФункции

&НаСервере
Функция СткПолучитьСоединение(Орг=Неопределено) Экспорт
	
	Стк = Новый Структура();
	Если Орг=Неопределено Тогда
		//Если  ПараметрыСеанса.ОтправкаНаВнешнийАдрес Тогда
			Стк.Вставить("Сервер","178.208.254.21");   // http://178.208.254.21:48088/
			Стк.Вставить("Порт",48088);
		//ИНАче
		//	Стк.Вставить("Сервер","192.168.40.9");
		//	Стк.Вставить("Порт",80);
		//КонецеСЛИ;
		
	ИНаче
		
		//Если ПараметрыСеанса.ОтправкаНаВнешнийАдрес Тогда
			Стр = СокрЛП(Орг.ВнешнийАдрес);
		//ИНАче
		//	Стр = СокрЛП(Орг.ВнутреннийАдрес);
		//КонецЕслИ;
		
		Стр = СтрЗаменить(Стр,":",Символы.ПС);
		Стк.Вставить("Сервер",СокрЛП(СтрПолучитьСтроку(Стр,1)));
		Если СтрЧислоСтрок(Стр)=1 ТОгда
			Стк.Вставить("Порт",80);
		ИНАче
			Стк.Вставить("Порт",Число(СтрПолучитьСтроку(Стр,2)));
		КонецЕсли;
		
	КонецЕсли;
	
//	сообщить(Стк.Сервер);
	
		
	Стк.Вставить("Логин","1с_Максим");
	Стк.Вставить("Пароль","092222");
	
	Возврат Стк;
	
КонецФункции


Функция ПолучитьСоединениеAZURESQL() экспорт
	
	  
	Соединение=Новый ComObject("ADODB.Connection");
	Соединение.CommandTimeout = 600;
	Соединение.ConnectionTimeout = 30;
	СтрСоединения = "Driver={SQL Server};Server=tcp:urals.database.windows.net,1433;Initial Catalog=SVOD;Persist Security Info=False;User ID=max;Password=1!qqqqqq;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;";//ПолучитьСтрокуСоединенияSQL();
	Попытка
		Соединение.Open(СтрСоединения);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	
	Возврат Соединение;
	
КонецФункции

//замена символов в переданной строке
// при передаче параметров (мСтрока, "01234", "98765")
// символы из строки мСтрока, являющиеся частью строки "01234", будут заменены на символы строки "98765" с соответствующим индексом
// Т.е.: 0 на 9, 1 на 8 и т.д.
//ненайденные во втором параметре символы пропускаются в результат "как есть"
Функция ЗаменаСимволов(пСтрока, пСимволыКЗамене, пСимволыПравильные) Экспорт
	вСтрока = "";
	Для Итр = 1 По СтрДлина(пСтрока) Цикл
		мСимволСтроки = Сред(пСтрока, Итр, 1);
		мПозиция = СтрНайти(пСимволыКЗамене, мСимволСтроки);
		Если мПозиция <> 0 Тогда
			мСимволСтроки = Сред(пСимволыПравильные, мПозиция, 1);
		КонецЕсли;
		вСтрока = вСтрока + мСимволСтроки;
	КонецЦикла;
	
	Возврат вСтрока;
КонецФункции