
&НаКлиенте
Функция ПОлучитьПробелы(п)
	Рез ="";
	Для а=1 по п Цикл
		Рез = Рез+" ";
	КонецЦикла;
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура СообщитьСтк(Рез,Стк,Отступ="")
	МасТип = Новый МАссив;
	МасТип.Добавить(Тип("Структура"));
	МасТип.Добавить(Тип("Соответствие"));
	
	
		Если МасТип.Найти(ТипЗнч(Стк))<>Неопределено  ТОгда
			Для каждого Эл из Стк Цикл
				Если МасТип.Найти(ТипЗнч(Эл.ЗНачение))<>Неопределено Тогда
					Рез = Рез+Отступ+Эл.Ключ+Символы.пс;
					СообщитьСтк(Рез,Эл.ЗНачение,Отступ+"    ");
				ИНАчеЕсли ТипЗнч(Эл.ЗНачение)= Тип("Массив") Тогда
					п = Отступ+ Эл.Ключ+": {"+Символы.пс;
					Рез = Рез+п;
					пробелы = ПолучитьПробелы(СтрДлина(п));
					СообщитьСтк(Рез,Эл.ЗНачение,пробелы);
					Рез = Рез+пробелы+"}"+Символы.пс;
				ИНАче
					Рез = Рез + Отступ + Эл.Ключ+": "+эл.значение+Символы.пс;
				КонецЕСлИ;
			КонецЦиклА;
			
		ИНачеЕсли ТипЗнч(Стк)= Тип("Массив") ТОгда
			Для каждого Эл из Стк Цикл
				Если МасТип.Найти(ТипЗнч(Эл))<>Неопределено Тогда
					Рез = Рез+Отступ+Символы.пс;
					СообщитьСтк(Рез,Эл,Отступ+"    ");
				ИНАчеЕсли ТипЗнч(Эл)= Тип("Массив") Тогда
					Рез = Рез+Отступ+"{"+Символы.пс;
					СообщитьСтк(Рез,Эл,Отступ+"    ");
					Рез = Рез+Отступ+"}"+Символы.пс;
				ИНАче
					Рез = Рез + Отступ + эл+Символы.пс;
				КонецЕСлИ;
			КонецЦикла;
		ИНАче
			Рез = Рез + Отступ + эл+Символы.пс;
		КонецЕСЛИ;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ОБъект.Тело);
	СообщитьСтк(ТелоСтр,ПрочитатьJSON(Чтение,Истина));
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	ОБработатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОБработатьНаСервере()
	Справочники.ЗапросыViber.ОбрабратботкаПринятогоСообщения(Объект.Ссылка);
КонецПроцедуры
