Функция ДанныеОПодписчике(сс) Экспорт
	ТекстЗапроса = "
	|select * from employees where idFL = N'"+СокрЛП(сс.идФЛ)+"'
	|
	|";
	
	Соединение = глОбщий.ПолучитьСоединениеAZURESQL();
	Записи=Новый ComObject("ADODB.RecordSet");
	Записи.Open(ТекстЗапроса,Соединение);
	
	Рез = "";
	Если Записи.EOF() = 0 ТОгда 
		Орг   = Сокрлп(Записи.Fields("descrOrg").Value);
		ФИО   = Сокрлп(Записи.Fields("descrFL").Value);
		подр = Сокрлп(Записи.Fields("Podr").Value);
		Длж = Сокрлп(Записи.Fields("DLG").Value);
		ДтПРм = Формат(Записи.Fields("dtPrm").Value,"ДФ=dd.MM.yyyy");
		Сос  =  Сокрлп(Записи.Fields("sost").Value);
		емайл  =  Сокрлп(Записи.Fields("email").Value);
		
		Рез = ""+ФИО+"
		| "+орг+"
		| "+подр+"
		| "+Длж+"
		| с "+ДтПРм+"
		| "+Сос+"
		| "+емайл+"  ";
		
		 
	КонецЕсли; 
	
	Записи.Close(); 
	Соединение.Close(); 
	
	Возврат Рез;
	
КонецФункции