
&НаСервереБезКонтекста
Функция  РОдительНом(Ном)
	Возврат Ном.РОдитель;
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент=Неопределено)
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		ГруппаНоменклатуры = РОдительНом(Запись.Номенклатура);
	КонецесЛИ;
	Если ЗначениеЗаполнено(ЕдИзм)=Ложь ТОгда
		ЕдИзм = ПолучитьШт(Запись.Номенклатура);
	КонецЕСЛИ;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНоменклатуруНаСервере(Имя,РОд,ЕдИзм,Ном)
	
	Если ЗначениеЗаполнено(Ном)=Ложь Тогда
		Обк = Справочники.Номенклатура.СоздатьЭлемент();
		Обк.Наименование = Имя;
		Обк.НаименованиеПолное = Имя;
		Обк.СтавкаНДС = перечисления.СтавкиНДС.НДС18;
		Обк.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("2.4.1");
	ИНАче
		Обк = ном.ПолучитьОбъект();
	КонецесЛИ;
	Обк.БазоваяЕдиницаИзмерения = ЕдИзм;
	Обк.Родитель = Род;
	Обк.Записать();
	
	Возврат Обк.Ссылка;
	
КонецФункции


&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	Если СокрлП(Запись.ПричинаОтказа)<>"" ТОгда
		Предупреждение("Есть причина отказа!");
		Возврат;
	КонецЕСЛИ;
	
	Запись.Номенклатура = СоздатьНоменклатуруНаСервере(Запись.Наименование,ГруппаНоменклатуры,ЕдИзм,Запись.Номенклатура);
	ЗаписатьНаСервере();
	ОбновлениеФормыПриЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НоменклатураПриИзменении();
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Элементы.СоздатьНоменклатуру.Заголовок = "Изменить номенклатуру";
	КонецеСЛИ;
	ВидимостьНаимИзнач();	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНаимИзнач()
	Элементы.НаименованиеИзначальное.Видимость = СокрЛП(Запись.Наименование)<>СокрЛП(Запись.НаименованиеИзначальное);
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьШт(Ном)
	Если ЗначениеЗаполнено(Ном) ТОгда
		Возврат Ном.БазоваяЕдиницаИзмерения;	
	ИНАче
		Возврат Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
	КонецеСЛИ;
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Обк = РеквизитФормыВЗначение("Запись");
	Обк.ДатаЗакрытияЗапроса = ТекущаяДата();
	Обк.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеФормыПриЗаписи() 
	ВидимостьНаимИзнач();
	ЭтаФорма.Прочитать();
	Если Запись.ПричинаОтказа<>"" Тогда
		Элементы.ПричинаОтказа.ЦветФона = WebЦвета.ЛососьСветлый;
		Элементы.Номенклатура.ЦветФона = Новый Цвет;
	ИНаче
		Элементы.Номенклатура.ЦветФона = WebЦвета.БледноЗеленый;
		Элементы.ПричинаОтказа.ЦветФона = Новый Цвет;
	КонецЕСЛИ;
	ОповеститьОбИзменении(ПолучитьКлючЗаписи(Запись.идЗапроса));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписи(идЗапроса)
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("идЗапроса",	идЗапроса);

	// Почему-то нужно создавать запись через массив (по другому не взлетало)
	МассивКлюча = Новый Массив;
	МассивКлюча.Добавить(СтруктураФормы);
	
	// Создание ключа записи регистра сведений
	Возврат Новый ("РегистрСведенийКлючЗаписи.ксЗапросНаНовуюНоменклатуру", МассивКлюча);	
	
КонецФункции

&НаКлиенте
Процедура Отказать(Команда)
	Если СокрлП(Запись.ПричинаОтказа)="" ТОгда
		Предупреждение("Не указана причина отказа!");
		Возврат;
	КонецЕСЛИ;
	ЗаписатьНаСервере();
	ОбновлениеФормыПриЗаписи();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕдИзм = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Запись.ЕдИзмСтр);
	Если ЗначениеЗаполнено(ЕдИзм)= Ложь ТОгда
		Элементы.ЕдИзм.Заголовок = "Ед: "+Запись.ЕдИзмСтр;
	КонецЕСЛИ;
КонецПроцедуры


